function solution(a, b) {
  // 분석
  // b에 7씩 더하다가 그 달의 마지막 날을 넘어가는 순간
  // a + 1, 넘어간 값 - 그 달의 마지막 날 => 다음 달의 시작점
  // 이런 법칙인데, 그냥 역추적해서 풀면 된다.
  
  // 풀이
  // 1. 결과로 쓸 요일 배열 하나 만든다.
  // 2. while로 반복문을 짜되, true로 조건을 주고 탈출조건을 안에 만들어준다.
  const result = ["dummy", "FRI", "SAT", "SUN", "MON", "TUE", "WED", "THU"];
  
  while (true) {
    // 3. 역추적 완료 범위 내로 오면 값을 반환한다. (탈출조건)
    if (a === 1 && b <= 7) return result[b];
      
    // 4. 보통 때는 걍 7계속 빼준다.
    b = b - 7;
      
    // 5. 달이 바뀔 때는 약간의 조정 작업을 거쳐준다.
    if (b <= 0) {
      --a;
      if (a === 4 || a === 6 || a === 9 || a === 11) b = 30 + b;
      else if (a === 2) b = 29 + b;
      else b = 31 + b;
    }
  }
}