function solution(n) {
  // 분석 
  // 진법 변환 함수와 기능을 잘 파악하고 있으면 더욱 간단하게 풀 수도 있다.
  // 우선 10진법을 -> 타 진법으로 변환하는 함수로 toString이 있다.
  // 이걸 활용해 3진법으로 변환하고, 이를 뒤집은 후, 다시 타 진법 -> 10진법으로 변환하는 함수를 쓰면된다.
  // 그건 parseInt의 부가적 기능으로 가능하다.
  
  // 풀이
  // 1. toString으로 10진법 -> 3진법
  // 2. split으로 배열화, reverse로 배열 뒤집기, join으로 다시 문자열화
  // 3. parseInt 부가 기능으로 3진법 -> 10진법
  // 4. parseInt는 첫째자리에 (스트링 타입) 숫자, 두번째 자리에 현재진법을 넣으면 10진법으로 변환해준다.
  // (단, 10진법 이하의 진법만 가능하다. ex) 16진법 -> 10진법은 parseInt로 변환 불가)
  
  return parseInt(n.toString(3).split('').reverse().join(''), 3)
}